# Написать 4 переменных
# Количество выполненных ДЗ (запишите значение 12)
# Количество затраченных часов (запишите значение 1.5)
# Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# Выведите на экран(в консоль), используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.
kol_zad = 12
kol_times = 1.5
name_kurs = 'Python'
all_times = kol_times / kol_zad
print('Курс:',name_kurs,',',' всего задач:',kol_zad,',',' затрачено часов:',kol_times,',',' среднее время выполнения',all_times,'часа.')