print('Задача №1') # 1st program
print('Решение: 9 ** 0.5 * 5')
print('Ответ: ', 9 ** 0.5 * 5)
print('------------------')
print('Задача №2') # 2nd program
print('Решение: 9.99 > 9.98 and 9.99 != 1000.1 or 9.99 > 1000')
print('Ответ: ', 9.99 > 9.98 and 9.99 != 1000.1 or 9.99 > 1000)
print('------------------')
print('Задача №3') # 3rd program
print('Решение: ', '(1234 % 1000 // 10)', '+ ' '(5678 % 1000 // 10)')
print('Ответ: ', (1234 % 1000 // 10) + (5678 % 1000 // 10))
print('------------------')
print('Задача №4') # 4th program
print('Два числа: 13.42 и 42.13')
print('Решение (равно по числу 42): "float (13.42 * 100 % 100)" = ', float (13.42 * 100 % 100), " | | int (42.13) = ", int (42.13))
print('Ответ: "float (13.42 * 100 % 100) " == " int (42.13)" ', float (13.42 * 100 % 100) == int (42.13))
print('-----')
print('Решение (равно по числу 13): "float (42.13 * 100 % 100)" = ', float (42.13 * 100 % 100), " | | int (13.42) = ", int (13.42))
print('Ответ: "float (42.13 * 100 % 100) " == " int (13.42)" ', float (42.13 * 100 % 100) == int (13.42))
print('-----')
print('Решение (вариант 2): ', '"bool (13.42 == 42.13)"')
print('Ответ: ', bool ('13.42 == 42.13'))
